# Import Pandas Library

In [1]:
import pandas as pd
import numpy as np

# Data Structures

## First: Series

In [153]:
lst = [1,2,3,4,5] 
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [154]:
# change dtype
s = pd.Series(lst,dtype=float)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [155]:
s = pd.Series(lst, index=['A','B','C','D','E'])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [156]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series( names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [157]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [158]:
# change the indexes
s3.index = [10, 20, 30, 40]
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [159]:
fruit1 = {'Apple': 40 , 'Banana': 50, 'Orange': 60}
ser1 = pd.Series(fruit1)
ser1

Apple     40
Banana    50
Orange    60
dtype: int64

In [160]:
fruit2 = {'Apple': 30 , 'Strawberry': 20, 'Orange': 20}
ser2 = pd.Series(fruit2)
ser2

Apple         30
Strawberry    20
Orange        20
dtype: int64

In [161]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [162]:
# Selecting
print(s3[20])  #index = 20

Sarah

In [163]:
# Slicing like numpy [start, end(execluded), gap]
# Note that the slice does not use the index labels as references, but the position
s3[:3] # from position 0 to 2

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [164]:
s3[:-1] # from 0 to last item(execluded)

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [165]:
s4 = pd.Series({50: "khlied",60:"omar",70:"salim"})
s3 = s3._append(s4)
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50    khlied
60      omar
70     salim
dtype: object

In [166]:
x = pd.Series(['a', 'b'])
y = pd.Series(['c', 'd'])
z = pd.concat([x, y])
z

0    a
1    b
0    c
1    d
dtype: object

In [167]:
z = pd.concat([x, y],ignore_index=True )
z

0    a
1    b
2    c
3    d
dtype: object

In [141]:
# delete an element 
s3.drop(60)

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50    khlied
70     salim
dtype: object

In [168]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50    khlied
60      omar
70     salim
dtype: object

In [143]:
# drop duplicate elements
s3.drop_duplicates()

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50    khlied
60      omar
70     salim
dtype: object

In [169]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [170]:
s4 = s.copy()
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [171]:
s4 = s4*3
s4

A     3
B     6
C     9
D    12
E    15
dtype: int64

In [172]:
s4.add(s)

A     4
B     8
C    12
D    16
E    20
dtype: int64

In [173]:
s5 = pd.Series({'A': 6, 'B': 8})
s5 = s5.add(s)
s5

A     7.0
B    10.0
C     NaN
D     NaN
E     NaN
dtype: float64

In [174]:
s5 # you have to save the result

A     7.0
B    10.0
C     NaN
D     NaN
E     NaN
dtype: float64

In [175]:
s4.sub(s)

A     2
B     4
C     6
D     8
E    10
dtype: int64

In [176]:
s4.mul(s)

A     3
B    12
C    27
D    48
E    75
dtype: int64

In [177]:
s4.div(s)

A    3.0
B    3.0
C    3.0
D    3.0
E    3.0
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [179]:
data = {'SalesPerson': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'Region': ['East', 'West', 'North', 'South', 'North', 'North', 'East'],
        'OrderAmount': [600, 700, 400, 500, 400, 700, 800],
        'Month': ['Jan', 'Feb', 'Feb', 'Mar', 'May', 'Apr', 'May'],
        'isAccepted': [True, False, False, True, True, True, False]
       }

SalesDF = pd.DataFrame(data)
SalesDF

  SalesPerson Region  OrderAmount Month  isAccepted
0      Kathey   East          600   Jan        True
1     Michael   West          700   Feb       False
2     William  North          400   Feb       False
3      Kathey  South          500   Mar        True
4     William  North          400   May        True
5      Kathey  North          700   Apr        True
6     Michael   East          800   May       False

In [180]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data)
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [181]:
edu = pd.read_csv('/Users/a7mad/Desktop/git_lab/Day-8/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [182]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

# Viewing Data

In [188]:
edu.head() #first rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [189]:
edu.head(3)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [ ]:
edu.shape

In [190]:
edu.tail() #last rows that are listed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [193]:
edu.columns

Index(['TIME', 'GEO', 'INDIC_ED', 'Value', 'Flag and Footnotes'], dtype='object')

In [200]:
edu.columns = ['GEO']
print(edu)

ValueError: Length mismatch: Expected axis has 5 elements, new values have 1 elements

In [201]:
edu.columns[0]

'TIME'

In [202]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [203]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2001, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2002, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '5.00', 'e'],
       ...,
       [2009, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.81', nan],
       [2010, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.85', nan],
       [2011, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.76', nan]], dtype=object)

In [213]:
# quick statistical information
edu[['GEO']].describe()

                                  GEO
count                             384
unique                             32
top     European Union (28 countries)
freq                               12

In [219]:
edu.describe(include=[object])

,GEO,INDIC_ED,Value,Flag and Footnotes
count,384,384,384,165
unique,32,1,211,6
top,European Union (28 countries),Total public expenditure on education as % of ...,:,e
freq,12,384,23,70

In [271]:
edu.describe()

              TIME
count   384.000000
mean   2005.500000
std       3.456556
min    2000.000000
25%    2002.750000
50%    2005.500000
75%    2008.250000
max    2011.000000

In [222]:
edu.T

,0,1,2,3,4,5,6,7,8,9,...,374,375,376,377,378,379,380,381,382,383
TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
INDIC_ED,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...
Value,:,:,5.00,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.30,6.18,5.90,6.10,6.81,6.85,6.76
Flag and Footnotes,NaN,NaN,e,e,e,e,e,e,e,e,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selection

In [226]:
edu[['Value']] # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

    Value
0       :
1       :
2    5.00
3    5.03
4    4.95
..    ...
379  5.90
380  6.10
381  6.81
382  6.85
383  6.76

[384 rows x 1 columns]

In [227]:
edu[['Value','GEO']]

    Value                            GEO
0       :  European Union (28 countries)
1       :  European Union (28 countries)
2    5.00  European Union (28 countries)
3    5.03  European Union (28 countries)
4    4.95  European Union (28 countries)
..    ...                            ...
379  5.90                        Finland
380  6.10                        Finland
381  6.81                        Finland
382  6.85                        Finland
383  6.76                        Finland

[384 rows x 2 columns]

In [231]:
edu.loc[10:14,['TIME']] # select a subset of rows from a DataFrame

    TIME
10  2010
11  2011
12  2000
13  2001
14  2002

In [229]:
edu.loc[90:94, ['TIME', 'GEO']]  #[rows, columns]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [234]:
edu.loc[90:94,:] #[rows, columns=all]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [243]:
edu.sample(10,) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
210,2006,Italy,Total public expenditure on education as % of ...,4.67,NaN
60,2000,Euro area (15 countries),Total public expenditure on education as % of ...,:,u
248,2008,Lithuania,Total public expenditure on education as % of ...,4.88,NaN
152,2008,Estonia,Total public expenditure on education as % of ...,5.61,NaN
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d
312,2000,Poland,Total public expenditure on education as % of ...,4.87,i
145,2001,Estonia,Total public expenditure on education as % of ...,5.24,NaN
173,2005,Greece,Total public expenditure on education as % of ...,4.09,NaN
112,2004,Czech Republic,Total public expenditure on education as % of ...,4.20,NaN
188,2008,Spain,Total public expenditure on education as % of ...,4.62,NaN

# Filtering Data

In [249]:
edu[edu['Value'].astype(float) > 6.5]

ValueError: could not convert string to float: ':'

In [250]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value'] > 6.5]

TypeError: '>' not supported between instances of 'str' and 'float'

# Filtering Missing and dupliacated Values

In [251]:
edu['Value'].isnull()#.sum()

0      False
1      False
2      False
3      False
4      False
       ...
379    False
380    False
381    False
382    False
383    False
Name: Value, Length: 384, dtype: bool

In [252]:
edu[edu['Value'].isnull()].head()

Empty DataFrame
Columns: [TIME, GEO, INDIC_ED, Value, Flag and Footnotes]
Index: []

In [253]:
edu[edu.duplicated('Value')]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
...,...,...,...,...,...
369,2009,Slovakia,Total public expenditure on education as % of ...,4.09,d
370,2010,Slovakia,Total public expenditure on education as % of ...,4.22,d
375,2003,Finland,Total public expenditure on education as % of ...,6.43,NaN
378,2006,Finland,Total public expenditure on education as % of ...,6.18,NaN
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN

In [254]:
edu.drop_duplicates('Value')

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
...,...,...,...,...,...
377,2005,Finland,Total public expenditure on education as % of ...,6.30,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

# Manipulating Data

In [ ]:
edu.head()

In [255]:
edu['Value'].head()

0       :
1       :
2    5.00
3    5.03
4    4.95
Name: Value, dtype: object

In [256]:
edu['Value'] / 100 # you can apply it by one step

TypeError: unsupported operand type(s) for /: 'str' and 'int'

In [258]:
# we can apply any function to a DataFrame or Series
edu['Value'].astype(float)
edu['Value'].apply(np.sqrt) # sqrt function from the numpy library

ValueError: could not convert string to float: ':'

In [ ]:
edu['Value'].map(np.sqrt)

In [259]:
def f2(x):
    return x**2
edu['Value'].apply(f2)

TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'int'

In [ ]:
edu['Value'].apply(lambda d: d**2)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] =

In [260]:
edu[['Value','TIME']].apply(lambda)

SyntaxError: invalid syntax (2914487041.py, line 1)

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

In [ ]:
edu

In [ ]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

In [ ]:
edu

In [ ]:
# insert a new row
# ignore_index=True, otherwise the index 0
edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)
edu.tail()

In [ ]:
# remove row(axis=0)
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

In [ ]:
# to clear data frame
edu.drop(edu.index, inplace=False)

# Sorting

In [261]:
edu.sort_values(by='Value', ascending=False, inplace=True)
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
60,2000,Euro area (15 countries),Total public expenditure on education as % of ...,:,u
72,2000,Euro area (13 countries),Total public expenditure on education as % of ...,:,u
84,2000,Belgium,Total public expenditure on education as % of ...,:,u

In [262]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=0, ascending=True, inplace=True)
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

# Grouping Data

In [ ]:
# By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:
# 1. Splitting the data into groups based on some criteria
# 2. Applying a function to each group independently
# 3. Combining the results into a data structure

In [263]:
edu.groupby('GEO').mean()

/var/folders/51/yn8s64cn1k9g94w1rvvfrc140000gn/T/ipykernel_5878/1065924420.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  edu.groupby('GEO').mean()

                                                    TIME
GEO
Austria                                           2005.5
Belgium                                           2005.5
Bulgaria                                          2005.5
Cyprus                                            2005.5
Czech Republic                                    2005.5
Denmark                                           2005.5
Estonia                                           2005.5
Euro area (13 countries)                          2005.5
Euro area (15 countries)                          2005.5
Euro area (17 countries)                          2005.5
Euro area (18 countries)                          2005.5
European Union (25 countries)                     2005.5
European Union (27 countries)                     2005.5
European Union (28 countries)                     2005.5
Finland                                           2005.5
France                                            2005.5
Germany (until 1990 former territory of the FRG)  2005.5
Greece                                            2005.5
Hungary                                           2005.5
Ireland                                           2005.5
Italy                                             2005.5
Latvia                                            2005.5
Lithuania                                         2005.5
Luxembourg                                        2005.5
Malta                                             2005.5
Netherlands                                       2005.5
Poland                                            2005.5
Portugal                                          2005.5
Romania                                           2005.5
Slovakia                                          2005.5
Slovenia                                          2005.5
Spain                                             2005.5

In [264]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

/var/folders/51/yn8s64cn1k9g94w1rvvfrc140000gn/T/ipykernel_5878/800833940.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group = edu[['GEO', 'Value']].groupby('GEO').mean()

Empty DataFrame
Columns: []
Index: [Austria, Belgium, Bulgaria, Cyprus, Czech Republic]

# Merging Data

In [265]:
df = pd.DataFrame(np.random.randn(10, 4))

In [266]:
df[:3]

          0         1         2         3
0 -0.284264  1.414184 -1.316545 -1.108668
1  0.608610 -0.419394 -1.530958 -0.047350
2 -1.753136  0.627662 -0.302900 -1.483682

In [267]:
df[3:7]

          0         1         2         3
3  0.188853  0.261681  0.243626 -0.544667
4  0.633745  0.720179  0.864941  1.174589
5  1.969500  0.397174  1.239127  0.505481
6  1.312974  1.642056  1.478724 -0.719389

In [268]:
df[7:]

          0         1         2         3
7  0.301278 -0.092318 -0.451587  0.405635
8  1.130388 -1.492670 -1.775101 -0.709516
9 -1.462006  2.295944 -1.065059 -0.610573

In [269]:
pd.concat()

TypeError: concat() missing 1 required positional argument: 'objs'

In [270]:
pd.merge(left, right, on="key")

NameError: name 'left' is not defined

# Resources
- Chapter 2, Introduction to Data Science by Laura Igual and Santi SeguÃ­
    - https://github.com/DataScienceUB/introduction-datascience-python-book 
- pandas Documentation: https://pandas.pydata.org/